# Insert Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DefinitionBindingMap..::..Insert Method
DefinitionBindingMap Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Insert(
	Definition key,
	Binding item
)
```

Visual Basic
---
```text
Public Overridable Function Insert ( _
	key As Definition, _
	item As Binding _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Insert(
	Definition^ key,
	Binding^ item
)
```

# ### Parameters
key
    Type: Autodesk.Revit.DB..::..Definition
item
    Type: Autodesk.Revit.DB..::..Binding
# See Also
DefinitionBindingMap Class
Autodesk.Revit.DB Namespace